/*
Navicat MySQL Data Transfer

Source Server         : localhost_3306
Source Server Version : 50533
Source Host           : localhost:3306
Source Database       : phone

Target Server Type    : MYSQL
Target Server Version : 50533
File Encoding         : 65001

Date: 2016-10-08 15:04:34
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for `hpzc_cgd`
-- ----------------------------
DROP TABLE IF EXISTS `hpzc_cgd`;
CREATE TABLE `hpzc_cgd` (
  `h_id` varchar(32) NOT NULL COMMENT '进货单ID',
  `h_code` varchar(16) DEFAULT NULL COMMENT '进货编号',
  `h_name` varchar(16) DEFAULT NULL COMMENT '订单号',
  `h_date` varchar(16) DEFAULT NULL COMMENT '进货日期',
  `h_pur_code` varchar(16) DEFAULT NULL COMMENT '采购人ID',
  `h_pur_name` varchar(16) DEFAULT NULL COMMENT '采购人姓名',
  `h_play_code` varchar(16) DEFAULT NULL,
  `h_play_name` varchar(16) DEFAULT NULL,
  `h_cus_code` varchar(16) DEFAULT NULL COMMENT '保管人ID',
  `h_cus_name` varchar(100) DEFAULT NULL COMMENT '保管人姓名',
  `h_xgr` varchar(16) DEFAULT NULL COMMENT '修改人',
  `h_xgrq` date DEFAULT NULL COMMENT '修改日期',
  `h_cjrq` date DEFAULT NULL COMMENT '创建日期',
  `h_gysbm` varchar(16) DEFAULT NULL COMMENT '供应商编码',
  `h_gysmc` varchar(100) DEFAULT NULL COMMENT '供应商名称',
  `h_pur_money` double DEFAULT NULL COMMENT '采购总金额',
  `h_zffsbm1` varchar(16) DEFAULT NULL COMMENT '支付方式编码1',
  `h_zffsmc` varchar(100) DEFAULT NULL COMMENT '支付方式名称1',
  `h_zfje1` double DEFAULT NULL COMMENT '支付金额1',
  `h_zffsbm2` varchar(16) DEFAULT NULL COMMENT '支付方式编码2',
  `h_zffsmc2` varchar(100) DEFAULT NULL COMMENT '支付方式名称2',
  `h_zfje2` double DEFAULT NULL COMMENT '支付金额2',
  `h_zffsbm3` varchar(16) DEFAULT NULL COMMENT '支付方式编码3',
  `h_zffsmc3` varchar(100) DEFAULT NULL COMMENT '支付方式名称3',
  `h_zfje3` double DEFAULT NULL COMMENT '支付金额3',
  `h_memo1` varchar(200) DEFAULT NULL COMMENT '支付描述1',
  `h_memo2` varchar(200) DEFAULT NULL COMMENT '支付描述2',
  `h_memo3` varchar(200) DEFAULT NULL COMMENT '支付描述3',
  `h_remark1` varchar(200) DEFAULT NULL COMMENT '备注1',
  `h_remark2` varchar(200) DEFAULT NULL COMMENT '备注2',
  `h_remark3` varchar(200) DEFAULT NULL COMMENT '备注3',
  `is_delete` char(1) DEFAULT '0' COMMENT '是否删除标识！0：false 1:true',
  `status` char(1) DEFAULT '0',
  `h_type` char(1) DEFAULT '0' COMMENT '单据类型!',
  `h_zdrq` varchar(10) DEFAULT NULL COMMENT '制单日期',
  PRIMARY KEY (`h_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='进货单';

-- ----------------------------
-- Records of hpzc_cgd
-- ----------------------------
INSERT INTO `hpzc_cgd` VALUES ('1', 'GH-20160820001', '201608', '2016-09-29', '201608001', '测试1', '201608001', '测试1', '201608001', '测试1', '测试1', '2016-09-14', '2016-08-22', '201608001', '泰和1', '1000', '008', '现金', '1000', '008', '现金', '1000', '008', '现金', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-22', '', '', '0', '0', '0', '2016-08-22');
INSERT INTO `hpzc_cgd` VALUES ('10', 'GH-20160820001', '201608', '2016/8/20', '201608010', '测试10', '201608010', '测试10', '201608010', '测试10', '测试10', '2016-08-31', '2016-08-31', '201608010', '泰和10', '1200', '009', '微信', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-31', '', '', '0', '0', '0', '2016-08-31');
INSERT INTO `hpzc_cgd` VALUES ('11', 'GH-20160820001', '201609', '2016/8/20', '201608011', '测试11', '201608011', '测试11', '201608011', '测试11', '测试11', '2016-09-01', '2016-09-01', '201608011', '泰和11', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-09-01', '', '', '0', '0', '0', '2016-09-01');
INSERT INTO `hpzc_cgd` VALUES ('12', 'GH-20160820001', '201609', '2016/8/20', '201608012', '测试12', '201608012', '测试12', '201608012', '测试12', '测试12', '2016-09-02', '2016-09-02', '201608012', '泰和12', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-09-02', '', '', '0', '0', '0', '2016-09-02');
INSERT INTO `hpzc_cgd` VALUES ('13', 'GH-20160820001', '201609', '2016-09-20', '201608013', '测试13', '201608013', '测试13', '201608013', '测试13', '测试13', '2016-09-14', '2016-09-03', '201608013', '泰和13', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-09-03', '', '', '0', '0', '0', '2016-09-03');
INSERT INTO `hpzc_cgd` VALUES ('14', 'GH-20160820001', '201609', '2016/8/20', '201608014', '测试14', '201608014', '测试14', '201608014', '测试14', '测试14', '2016-09-04', '2016-09-04', '201608014', '泰和14', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-09-04', '', '', '0', '0', '0', '2016-09-04');
INSERT INTO `hpzc_cgd` VALUES ('15', 'GH-20160820001', '201609', '2016/8/20', '201608015', '测试15', '201608015', '测试15', '201608015', '测试15', '测试15', '2016-09-05', '2016-09-05', '201608015', '泰和15', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '010', '支付宝', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-09-05', '', '', '0', '0', '0', '2016-09-05');
INSERT INTO `hpzc_cgd` VALUES ('2', 'GH-20160820001', '201608', '2016/8/20', '201608002', '测试2', '201608002', '测试2', '201608002', '测试2', '测试2', '2016-08-23', '2016-08-23', '201608002', '泰和2', '1000', '008', '现金', '1000', '008', '现金', '1000', '008', '现金', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-23', '', '', '0', '0', '0', '2016-08-23');
INSERT INTO `hpzc_cgd` VALUES ('3', 'GH-20160820001', '201608', '2016-09-14', '201608003', '测试3', '201608003', '测试3', '201608003', '测试3', '测试3', '2016-09-14', '2016-08-24', '201608003', '泰和3', '1000', '008', '现金', '1000', '008', '现金', '1000', '008', '现金', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-24', '', '', '0', '0', '0', '2016-08-24');
INSERT INTO `hpzc_cgd` VALUES ('3A9F6642B8DA4368BC13346B2BB34154', 'CG-20160900006', '201609', '2016-09-08', null, '测试1', null, null, null, null, '', '2016-09-29', '2016-09-14', '201609001', '泰和1', null, null, null, null, null, null, null, null, null, null, null, null, null, '2016-09-14', null, null, '1', '0', '0', '2016-09-14');
INSERT INTO `hpzc_cgd` VALUES ('4', 'GH-20160820001', '201608', '2016/8/20', '201608004', '测试4', '201608004', '测试4', '201608004', '测试4', '测试4', '2016-08-25', '2016-08-25', '201608004', '泰和4', '1000', '008', '现金', '1000', '008', '现金', '1000', '008', '现金', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-25', '', '', '0', '0', '0', '2016-08-25');
INSERT INTO `hpzc_cgd` VALUES ('5', 'GH-20160820001', '201608', '2016/8/20', '201608005', '测试5', '201608005', '测试5', '201608005', '测试5', '测试5', '2016-08-26', '2016-08-26', '201608005', '泰和5', '1000', '008', '现金', '1000', '008', '现金', '1000', '008', '现金', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-26', '', '', '0', '0', '0', '2016-08-26');
INSERT INTO `hpzc_cgd` VALUES ('6', 'GH-20160820001', '201608', '2016/8/20', '201608006', '测试6', '201608006', '测试6', '201608006', '测试6', '测试6', '2016-08-27', '2016-08-27', '201608006', '泰和6', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-27', '', '', '0', '0', '0', '2016-08-27');
INSERT INTO `hpzc_cgd` VALUES ('7', 'GH-20160820001', '201608', '2016/8/20', '201608007', '测试7', '201608007', '测试7', '201608007', '测试7', '测试7', '2016-08-28', '2016-08-28', '201608007', '泰和7', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-28', '', '', '0', '0', '0', '2016-08-28');
INSERT INTO `hpzc_cgd` VALUES ('8', 'GH-20160820001', '201608', '2016/8/20', '201608008', '测试8', '201608008', '测试8', '201608008', '测试8', '测试8', '2016-08-29', '2016-08-29', '201608008', '泰和8', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-29', '', '', '0', '0', '0', '2016-08-29');
INSERT INTO `hpzc_cgd` VALUES ('9', 'GH-20160820001', '201608', '2016/8/20', '201608009', '测试9', '201608009', '测试9', '201608009', '测试9', '测试9', '2016-08-30', '2016-08-30', '201608009', '泰和9', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '009', '银行卡', '1000', '暂时欠款500', '10.1日付款', '周转中··', '2016-08-30', '', '', '0', '0', '0', '2016-08-30');
INSERT INTO `hpzc_cgd` VALUES ('BE24554B86874A4CB33F6CB0B8C524B0', 'CG-20160900007', '201609', '2016-09-14', null, '测试1', null, null, null, null, '测试1', '2016-09-29', '2016-09-14', '201608001', ' 泰和1', null, null, null, null, null, null, null, null, null, null, null, null, null, '2016-09-14', null, null, '1', '0', '0', '2016-09-14');
